zdavatz/fp-sns-stbox1/Middlewares/ST/STM32WB07_06/hci/controller/stm32wb07_06_hal_aci.c
ble_status_t aci_hal_transmitter_test_packets_v2(uint8_t tx_channel,
                                                 uint8_t test_data_length,
                                                 uint8_t packet_payload,
                                                 uint16_t number_of_packets,
                                                 uint8_t phy,
                                                 uint8_t cte_length,
                                                 uint8_t cte_type,
                                                 uint8_t switching_pattern_length,
                                                 uint8_t antenna_ids[])
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[532];
  aci_hal_transmitter_test_packets_v2_cp0 *cp0 = (aci_hal_transmitter_test_packets_v2_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->tx_channel = HTOB(tx_channel, 1);
  index_input += 1;
  cp0->test_data_length = HTOB(test_data_length, 1);
  index_input += 1;
  cp0->packet_payload = HTOB(packet_payload, 1);
  index_input += 1;
  cp0->number_of_packets = HTOB(number_of_packets, 2);
  index_input += 2;
  cp0->phy = HTOB(phy, 1);
  index_input += 1;
  cp0->cte_length = HTOB(cte_length, 1);
  index_input += 1;
  cp0->cte_type = HTOB(cte_type, 1);
  index_input += 1;
  cp0->switching_pattern_length = HTOB(switching_pattern_length, 1);
  index_input += 1;
  /* var_len_data input */
  {
    STM32WB07_06_MEMCPY((void *) &cp0->antenna_ids, (const void *) antenna_ids, switching_pattern_length * sizeof(uint8_t));
    index_input += switching_pattern_length * sizeof(uint8_t);
  }
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ext_aci = TRUE;
  rq_t.ogf = 0x3f;
  rq_t.ocf = 0x02c;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t aci_hal_set_priority(uint8_t ble_state,
                                  uint16_t connection_handle,
                                  uint8_t priority_max,
                                  uint8_t priority_min)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[532];
  aci_hal_set_priority_cp0 *cp0 = (aci_hal_set_priority_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->ble_state = HTOB(ble_state, 1);
  index_input += 1;
  cp0->connection_handle = HTOB(connection_handle, 2);
  index_input += 2;
  cp0->priority_max = HTOB(priority_max, 1);
  index_input += 1;
  cp0->priority_min = HTOB(priority_min, 1);
  index_input += 1;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ext_aci = TRUE;
  rq_t.ogf = 0x3f;
  rq_t.ocf = 0x030;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t aci_hal_set_ce_length(uint16_t ce_length)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[532];
  aci_hal_set_ce_length_cp0 *cp0 = (aci_hal_set_ce_length_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->ce_length = HTOB(ce_length, 2);
  index_input += 2;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ext_aci = TRUE;
  rq_t.ogf = 0x3f;
  rq_t.ocf = 0x034;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t aci_hal_write_radio_reg(uint32_t start_address,
                                     uint8_t num_bytes,
                                     uint8_t data[])
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[532];
  aci_hal_write_radio_reg_cp0 *cp0 = (aci_hal_write_radio_reg_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->start_address = HTOB(start_address, 4);
  index_input += 4;
  cp0->num_bytes = HTOB(num_bytes, 1);
  index_input += 1;
  /* var_len_data input */
  {
    STM32WB07_06_MEMCPY((void *) &cp0->data, (const void *) data, num_bytes * sizeof(uint8_t));
    index_input += num_bytes * sizeof(uint8_t);
  }
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ext_aci = TRUE;
  rq_t.ogf = 0x3f;
  rq_t.ocf = 0x035;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t aci_hal_read_radio_reg(uint32_t start_address,
                                    uint8_t num_bytes,
                                    uint8_t *data_length,
                                    uint8_t data[])
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[532];
  aci_hal_read_radio_reg_cp0 *cp0 = (aci_hal_read_radio_reg_cp0 *)(cmd_buffer);
  aci_hal_read_radio_reg_rp0 resp;
  STM32WB07_06_MEMSET(&resp, 0, sizeof(resp));
  uint8_t index_input = 0;
  cp0->start_address = HTOB(start_address, 4);
  index_input += 4;
  cp0->num_bytes = HTOB(num_bytes, 1);
  index_input += 1;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ext_aci = TRUE;
  rq_t.ogf = 0x3f;
  rq_t.ocf = 0x036;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &resp;
  rq_t.rlen = sizeof(resp);
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (resp.status)
  {
    return resp.status;
  }
  *data_length = BTOH(resp.data_length, 1);
  STM32WB07_06_MEMCPY((void *) data, (const void *) resp.data, *data_length * sizeof(uint8_t));
  return BLE_STATUS_SUCCESS;
}

ble_status_t aci_hal_set_antenna_switch_parameters(uint8_t antenna_ids,
                                                   uint8_t antenna_id_shift,
                                                   uint8_t default_antenna_id,
                                                   uint8_t rf_activity_enable)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[532];
  aci_hal_set_antenna_switch_parameters_cp0 *cp0 = (aci_hal_set_antenna_switch_parameters_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->antenna_ids = HTOB(antenna_ids, 1);
  index_input += 1;
  cp0->antenna_id_shift = HTOB(antenna_id_shift, 1);
  index_input += 1;
  cp0->default_antenna_id = HTOB(default_antenna_id, 1);
  index_input += 1;
  cp0->rf_activity_enable = HTOB(rf_activity_enable, 1);
  index_input += 1;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ext_aci = TRUE;
  rq_t.ogf = 0x3f;
  rq_t.ocf = 0x037;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t aci_hal_get_evt_fifo_max_level(uint16_t *isr0_fifo_max_level,
                                            uint16_t *isr1_fifo_max_level,
                                            uint16_t *user_fifo_max_level)
{
  struct hci_request rq_t;
  aci_hal_get_evt_fifo_max_level_rp0 resp;
  STM32WB07_06_MEMSET(&resp, 0, sizeof(resp));
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ext_aci = TRUE;
  rq_t.ogf = 0x3f;
  rq_t.ocf = 0x060;
  rq_t.rparam = &resp;
  rq_t.rlen = sizeof(resp);
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (resp.status)
  {
    return resp.status;
  }
  *isr0_fifo_max_level = BTOH(resp.isr0_fifo_max_level, 2);
  *isr1_fifo_max_level = BTOH(resp.isr1_fifo_max_level, 2);
  *user_fifo_max_level = BTOH(resp.user_fifo_max_level, 2);
  return BLE_STATUS_SUCCESS;
}

