zdavatz/fp-sns-stbox1/Middlewares/ST/STM32WB07_06/hci/controller/stm32wb07_06_hal_aci.c
ble_status_t aci_test_tx_notification_start(uint16_t connection_handle,
                                            uint16_t service_handle,
                                            uint16_t char_handle,
                                            uint16_t value_length)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[532];
  aci_test_tx_notification_start_cp0 *cp0 = (aci_test_tx_notification_start_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->connection_handle = HTOB(connection_handle, 2);
  index_input += 2;
  cp0->service_handle = HTOB(service_handle, 2);
  index_input += 2;
  cp0->char_handle = HTOB(char_handle, 2);
  index_input += 2;
  cp0->value_length = HTOB(value_length, 2);
  index_input += 2;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ext_aci = TRUE;
  rq_t.ogf = 0x3f;
  rq_t.ocf = 0x200;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t aci_test_tx_write_command_start(uint16_t connection_handle,
                                             uint16_t attr_handle,
                                             uint16_t value_length)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[532];
  aci_test_tx_write_command_start_cp0 *cp0 = (aci_test_tx_write_command_start_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->connection_handle = HTOB(connection_handle, 2);
  index_input += 2;
  cp0->attr_handle = HTOB(attr_handle, 2);
  index_input += 2;
  cp0->value_length = HTOB(value_length, 2);
  index_input += 2;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ext_aci = TRUE;
  rq_t.ogf = 0x3f;
  rq_t.ocf = 0x201;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t aci_test_rx_start(uint16_t connection_handle,
                               uint16_t attr_handle,
                               uint8_t notifications_write_cmds)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[532];
  aci_test_rx_start_cp0 *cp0 = (aci_test_rx_start_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->connection_handle = HTOB(connection_handle, 2);
  index_input += 2;
  cp0->attr_handle = HTOB(attr_handle, 2);
  index_input += 2;
  cp0->notifications_write_cmds = HTOB(notifications_write_cmds, 1);
  index_input += 1;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ext_aci = TRUE;
  rq_t.ogf = 0x3f;
  rq_t.ocf = 0x202;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t aci_test_stop(uint8_t tx_rx)
{
  struct hci_request rq_t;
  uint8_t cmd_buffer[532];
  aci_test_stop_cp0 *cp0 = (aci_test_stop_cp0 *)(cmd_buffer);
  ble_status_t status = 0;
  uint8_t index_input = 0;
  cp0->tx_rx = HTOB(tx_rx, 1);
  index_input += 1;
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ext_aci = TRUE;
  rq_t.ogf = 0x3f;
  rq_t.ocf = 0x203;
  rq_t.cparam = cmd_buffer;
  rq_t.command_len = index_input;
  rq_t.rparam = &status;
  rq_t.rlen = 1;
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (status)
  {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
ble_status_t aci_test_report(uint32_t *tx_packets,
                             uint32_t *rx_packets,
                             uint16_t *rx_data_length,
                             uint32_t *rx_sequence_errors)
{
  struct hci_request rq_t;
  aci_test_report_rp0 resp;
  STM32WB07_06_MEMSET(&resp, 0, sizeof(resp));
  STM32WB07_06_MEMSET(&rq_t, 0, sizeof(rq_t));
  rq_t.ext_aci = TRUE;
  rq_t.ogf = 0x3f;
  rq_t.ocf = 0x204;
  rq_t.rparam = &resp;
  rq_t.rlen = sizeof(resp);
  if (hci_send_req(&rq_t, FALSE) < 0)
  {
    return BLE_STATUS_TIMEOUT;
  }
  if (resp.status)
  {
    return resp.status;
  }
  *tx_packets = BTOH(resp.tx_packets, 4);
  *rx_packets = BTOH(resp.rx_packets, 4);
  *rx_data_length = BTOH(resp.rx_data_length, 2);
  *rx_sequence_errors = BTOH(resp.rx_sequence_errors, 4);
  return BLE_STATUS_SUCCESS;
}
